{
  "config": {
    "augment": [
      {
        "resize_and_padding": {
          "size": 224,
          "training": false
        }
      },
      {
        "to_tensor": "no_params"
      },
      {
        "normalize": {
          "mean": [
            0.485,
            0.456,
            0.406
          ],
          "std": [
            0.229,
            0.224,
            0.225
          ]
        }
      }
    ],
    "load_from": "Epoch_26.pt",
    "revision": "v4"
  },
  "model_type": "doraemon_embedding",
  "auto_map":{
    "AutoConfig": "doraemon_modeling.DoraemonConfig",
    "AutoModel": "doraemon_modeling.DoraemonEmbedding",
    "AutoProcessor": "doraemon_modeling.DoraemonImageProcessor"
  },
  "transformers_version": "4.48.3"
}
